## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_service_plan.example-asp will be created
  + resource "azurerm_service_plan" "example-asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "example-asp"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "test-RG"
      + sku_name                     = "P1v2"
      + worker_count                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>